{"current_room": 5, "inventory": [], "sanity": 26, "rooms": {"room1": [{"nameOfNpc": "nobody", "Location": "", "intros": "", "dialogue": []}, {"advil": {"heal": 5, "description": "Will help to recover lost sanity points and prevent you from falling victim to your thoughts"}}], "room2": [{"nameOfNpc": "nobody", "Location": "", "intros": "A room that can be described as organized chaos, nothings looks like it is where it is supposed to be but you know where everything is. Oddly enough there is a key on the floor that stands out from the chaos", "dialogue": []}, {"Computer": {}, "key": {"description": "A mysterious key lays on the floor, it does not match the dark gloomy feeling of the room. It looks to be lined with gold and have a bright red design on it there is also a name that you cannot make out on it"}}], "room3": [{"nameOfNpc": "John", "Location": "John's Quarters", "intros": "What you want I'm off the clock for another 4 hours", "dialogue": [{"Choice": "Has something felt off with Connor to you?", "Response": "..... stay away from that topic."}, {"Choice": "Has Chad been acting weird to you", "Response": "Chad is always weird with all those voices, if he was acting normal then I'd be concerned"}, {"Choice": "Alan has been pretty on edge, do you think happened?", "Response": "Someone went through his room and put a dent in his safe, so I would be on edge too."}]}, {}], "room4": [{"nameOfNpc": "Chad", "Location": "Chad's Quarters", "intros": "Hey buddy!!! Great to see you, come on in, I am just reading my DM manual", "dialogue": [{"Choice": "Have you seen Connor he has been acting a little different", "Response": "Thats a weird question to ask you ok?."}, {"Choice": "What do you think of John?", "Response": "He is a little introverted but a lot of fun to game with"}, {"Choice": "Have you seen Alan?", "Response": "He is in his room someone destroyed it, not cool at all"}]}, {}], "room5": [{"nameOfNpc": "Connor", "Location": "Connor's Quarters", "intros": "What do you want?", "dialogue": [{"Choice": "You ok?", "Response": "yes"}, {"Choice": "You talk to Chad about the game tonight", "Response": "yes and if not I will"}, {"Choice": "You worked with John right? You get along?", "Response": "Do we?"}, {"Choice": "Have you checked on Alan", "Response": "Probably should"}]}, {}], "room6": [{"nameOfNpc": "Alan", "Location": "Alan's Quarters", "intros": "Hey Green horn what do you need", "dialogue": [{"Choice": "Oh my god what happened", "Response": "Someone completely destroyed my room, for no clear reason"}, {"Choice": "Have you asked Chad", "Response": "He was with me when it happened, and no one else could lift my safe"}, {"Choice": "Where you mad at Connor?", "Response": "We had some beef but nothing to destroy my room over"}, {"Choice": "You ask John?", "Response": "I don't think he did it but who knows"}]}, {}]}}